# yaml-language-server: $schema=https://carapace.sh/schemas/command.json
name: update
description: Update a saved search for a given workspace.
flags:
    --category=: The category of the saved search.
    --display-name=: Display name of the saved search.
    --func-alias=: Function Aliases are short names given to Saved Searches so they can be easily referenced in query.
    --func-param=: The optional function parameters if query serves as a function.
    --subscription=: Name or ID of subscription.
    --tags=:
        description: 'space-separated tags: key[=value] [key[=value] ...].'
        nargs: -1
    --workspace-name=!: Name of the Log Analytics Workspace.
    -g, --resource-group=!: Name of resource group.
    -n, --name=!: Name of the saved search and it's unique in a given workspace.
    -q, --saved-query=: The query expression for the saved search.
documentation:
    flag:
        acquire-policy-token: Acquiring an Azure Policy token automatically for this resource operation.
        category: The category of the saved search. This helps the user to find a saved search faster.
        change-reference: The related change reference ID for this resource operation.
        display-name: 'Display name of the saved search. --fa --func-alias Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups. --fp --func-param The optional function parameters if query serves as a function. Value should be in the following format: ''param-name1:type1 = default_value1, param-name2:type2 = default_value2''. For more examples and proper syntax please refer to https://learn.microsoft.com/azure/kusto/query/functions/user-defined-functions .'
        func-alias: Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups.
        func-param: 'The optional function parameters if query serves as a function. Value should be in the following format: ''param-name1:type1 = default_value1, param-name2:type2 = default_value2''. For more examples and proper syntax please refer to https://learn.microsoft.com/azure/kusto/query/functions/user-defined-functions.'
        name: Name of the saved search and it's unique in a given workspace.
        resource-group: Name of resource group. You can configure the default group using ``` az configure --defaults group=<name> ``` .
        saved-query: The query expression for the saved search.
        subscription: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`
        tags: 'space-separated tags: key[=value] [key[=value] ...]. Use '''' to clear existing tags.'
        workspace-name: Name of the Log Analytics Workspace.
examples:
    Update a saved search for a given workspace.: az monitor log-analytics workspace saved-search update -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
